[{"id": 1, "name": "snikers", "description": "Snickers is a brand name chocolate bar made by the American company Mars, Incorporated, consisting of nougat topped with caramel and peanuts that has been enrobed in milk chocolate.[2] The annual global sales of Snickers was $2 billion as of 2004.[3]", "img_name": "snikers.jpg", "price": "25.5"}, {"id": 2, "name": "mars", "description": "Mars is a variety of chocolate bar produced by Mars, Incorporated. It was first manufactured in 1932 in Slough, England by Forrest Mars, Sr.[2] The bar was sold in two different formulations. In its original British version the bar consists of caramel and nougat coated with milk chocolate, developed to resemble the American chocolate bar known as the Milky Way, which had been introduced a decade earlier. An American version of the Mars Bar was produced which had nougat and toasted almonds covered in milk chocolate; later, caramel was added to the recipe as well. The American version was discontinued in 2002, and then revived the following year under the name \"Snickers Almond\".", "img_name": "mars.jpg", "price": "25.5"}, {"id": 3, "name": "bannan", "description": "Musa is one of two or three genera in the family Musaceae; it includes bananas and plantains. Around 70 species of Musa are known, with a broad variety of uses", "img_name": "bannan.jpg", "price": "30"}, {"id": 4, "name": "orange", "description": "The orange is the fruit of the citrus species Citrus × sinensis in the family Rutaceae, native to China.[1] It is also called sweet orange, to distinguish it from the related Citrus × aurantium, referred to as bitter orange. The sweet orange reproduces asexually (apomixis through nucellar embryony); varieties of sweet orange arise through mutations", "img_name": "orange.jpg", "price": "52.4"}, {"id": 5, "name": "onion", "description": "The onion (Allium cepa L., from Latin cepa \"onion\"), also known as the bulb onion or common onion, is a vegetable that is the most widely cultivated species of the genus Allium. Its close relatives include the garlic, shallot, leek, chive,[2] and Chinese onion.[3]", "img_name": "onion.jpg", "price": "12.5"}, {"id": 6, "name": "apple", "description": "An apple is a sweet, edible fruit produced by an apple tree (Malus domestica). Apple trees are cultivated worldwide and are the most widely grown species in the genus Malus. ", "img_name": "apple.jpg", "price": "8.2"}, {"id": 7, "name": "bread", "description": "Bread is a staple food prepared from a dough of flour and water, usually by baking. Throughout recorded history it has been a prominent food in large parts of the world and is one of the oldest man-made foods, having been of significant importance since the dawn of agriculture.", "img_name": "bread.jpg", "price": "15"}, {"id": 8, "name": "carrot", "description": "The carrot (Daucus carota subsp. sativus) is a root vegetable, usually orange in colour, though purple, black, red, white, and yellow cultivars exist.[1] Carrots are a domesticated form of the wild carrot, Daucus carota, native to Europe and Southwestern Asia.", "img_name": "carrot.jpg", "price": "34"}, {"id": 9, "name": "potato", "description": "The potato is a root vegetable, a starchy tuber of the plant Solanum tuberosum, and the plant itself, a perennial in the family Solanaceae,[2] native to the Americas.", "img_name": "potato.jpg", "price": "5.4"}]